# ETL a CSV File with Python + SQL

In [ ]:
import csv
from DATA225utils import make_connection

In [ ]:
conn = make_connection(config_file = 'titanic.ini')
cursor = conn.cursor()

### A cleaned table of all the passengers: `all_passengers_1`

In [ ]:
cursor.execute('DROP TABLE IF EXISTS all_passengers_1')

sql = ( """
        CREATE TABLE all_passengers_1
        (
            name       varchar(32),
            survived   varchar(3),
            sex        varchar(6),
            age        double,
            class      int,
            PRIMARY KEY(name)
        )
        """
      )

cursor.execute(sql);

### A cleaned table of the male passengers who survived: `male_survivors`

In [ ]:
cursor.execute('DROP TABLE IF EXISTS male_survivors')

sql = ( """
        CREATE TABLE male_survivors
        (
            name  varchar(32),
            age   double,
            class int,
            PRIMARY KEY(name)
        )
        """
      )

cursor.execute(sql);

### A function to clean (transform) each row:
-  age   'NA'  ==> 0
-  klass '1st' ==> 1
-  klass '2nd' ==> 2
-  klass '3rd' ==> 3

In [ ]:
def transform(row):
    if row[3] == 'NA':
        row[3] = 0

    klass = row[4]

    if klass == '1st':
        row[4] = 1
    elif klass == '2nd':
        row[4] = 2
    elif klass == '3rd':
        row[4] = 3
    else:
        row[4] = 0

### SQL to load the two tables.

In [ ]:
sql_all = (   """
              INSERT INTO all_passengers_1
              VALUES (%s, %s, %s, %s, %s)
              """
          )

sql_male = (   """
               INSERT INTO male_survivors
               VALUES (%s, %s, %s)
               """
           )

### Extract, transform, and load (ETL).

In [ ]:
first = True
i = 0

with open('TitanicSurvival.csv', newline='') as csv_file:
    data = csv.reader(csv_file, delimiter=',', quotechar='"')
    
    for row in data:
        if not first:
            transform(row)
            cursor.execute(sql_all, row)
            
            if (row[1] == 'yes') and (row[2] == 'male'):
                row.remove('yes')
                row.remove('male')

                cursor.execute(sql_male, row)
            
        first = False
    
conn.commit()

In [ ]:
cursor.close()
conn.close()

In [ ]:
# Copyright (c) 2023 by Ronald Mak